//ADCDIR JOB NOTIFY=ADCDI,REGION=5M,TIME=(0,9)
//S1 EXEC PGM=DAILYRPT
//STEPLIB DD DSN=ADCDI.SSR.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//TXNKSDS  DD DSN=ADCD.HAWKS.TXNLDGR,DISP=SHR
//LOANKSDS DD DSN=ADCD.HAWKS.LOANMSTR,DISP=SHR
//OUTRPT   DD DSN=ADCDI.PROJ.RPT97,DISP=SHR
//*
//S2 EXEC PGM=DLYKSDS
//STEPLIB DD DSN=ADCDI.SSR.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//DD1 DD DSN=ADCDI.PROJ.RPT97,DISP=SHR
//DD2 DD DSN=ADCD.HAWKS.DASHBRD2,DISP=SHR
//*
//STEP3 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//TXNIN DD DSN=ADCD.HAWKS.PLLDGR,DISP=SHR
//OUTFILE  DD DSN=ADCDT.DALIY,DISP=SHR
//SYSIN    DD *
  REPRO INFILE(TXNIN) OUTFILE(OUTFILE)
/*
//STEP4 EXEC PGM=DALIYGDG
//STEPLIB  DD DSN=ADCDT.LOADLIB,DISP=SHR

//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*

//DD1      DD DSN=ADCDT.DALIY,DISP=SHR
//DD2      DD DSN=ADCDT.DALIY.GDG(+1),
//            DISP=(NEW,CATLG,DELETE),
//            SPACE=(TRK,(5,5)),
//            DCB=(RECFM=FB,LRECL=80)

