//ADCDIR JOB NOTIFY=ADCDI,REGION=5M,TIME=(0,9)
//S1 EXEC PGM=DELINQ2
//STEPLIB DD DSN=ADCDI.SSR.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//DD2      DD DSN=ADCD.HAWKS.TXNLDGR,DISP=SHR
//DD1      DD DSN=ADCD.HAWKS.LOANMSTR,DISP=SHR
//DD3      DD DSN=ADCDI.PROJ.DELINQPS,DISP=SHR

